src/cf/InformationRegisters/СвязиАдресатКонтактCRM.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>СвязиАдресатКонтактCRM</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Адресат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АдресатыПисем</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КонтактCRM</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КонтактПисьма</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/СвязиАдресатКонтактCRM/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Связывание адресатов контрагента с лидом
//
// Параметры:
//  Контрагент - СправочникСсылка.Контрагенты
//  Лид - СправочникСсылка.Лиды
//
Процедура СвязатьАдресатовКонтрагентаСЛидом(Контрагент, Лид) Экспорт
	
	НаборЗаписейКонтрагента = РегистрыСведений.СвязиАдресатКонтактCRM.СоздатьНаборЗаписей();
	НаборЗаписейКонтрагента.Отбор.КонтактCRM.Установить(Контрагент);
	НаборЗаписейКонтрагента.Прочитать();
	
	НаборЗаписейЛида = РегистрыСведений.СвязиАдресатКонтактCRM.СоздатьНаборЗаписей();
	НаборЗаписейЛида.Отбор.КонтактCRM.Установить(Лид);
	НаборЗаписейЛида.Прочитать();
	
	ЗаписиНаУдаление = Новый Массив;
	Для Каждого ЗаписьЛида Из НаборЗаписейЛида Цикл
		
		ЗаписиЛидаНетУКонтрагента = Истина;
		
		Для Каждого ЗаписьКонтрагента Из НаборЗаписейКонтрагента Цикл
			
			Если ЗаписьЛида.Адресат = ЗаписьКонтрагента.Адресат И ЗаписьЛида.КонтактCRM = ЗаписьКонтрагента.КонтактCRM Тогда
				ЗаписиЛидаНетУКонтрагента = Ложь;
				Прервать;
			КонецЕсли;
			
		КонецЦикла;
		
		Если ЗаписиЛидаНетУКонтрагента Тогда
			ЗаписиНаУдаление.Добавить(ЗаписьЛида);
		КонецЕсли;
		
	КонецЦикла;
	
	АдресатыНаДобавление = Новый Массив;
	Для Каждого ЗаписьКонтрагента Из НаборЗаписейКонтрагента Цикл
		
		ЗаписиКонтрагентаНетУЛида = Истина;
		
		Для Каждого ЗаписьЛида Из НаборЗаписейЛида Цикл
			
			Если ЗаписьЛида.Адресат = ЗаписьКонтрагента.Адресат И ЗаписьЛида.КонтактCRM = ЗаписьКонтрагента.КонтактCRM Тогда
				ЗаписиКонтрагентаНетУЛида = Ложь;
				Прервать;
			КонецЕсли;
			
		КонецЦикла;
		
		Если ЗаписиКонтрагентаНетУЛида Тогда
			АдресатыНаДобавление.Добавить(ЗаписьКонтрагента.Адресат);
		КонецЕсли;
		
	КонецЦикла;
	
	Для Каждого Запись Из ЗаписиНаУдаление Цикл
		НаборЗаписейЛида.Удалить(Запись);
	КонецЦикла;
	Для Каждого Адресат Из АдресатыНаДобавление Цикл
		НоваяЗапись = НаборЗаписейЛида.Добавить();
		НоваяЗапись.Адресат = Адресат;
		НоваяЗапись.КонтактCRM = Лид;
	КонецЦикла;
	
	НаборЗаписейЛида.Записать();
	
КонецПроцедуры

// Возвращает массив адресатов контакта
//
// Параметры:
//  КонтактCRM - ОпределяемыйТип.КонтактПисьма
// 
// Возвращаемое значение:
//  Массив из СправочникСсылка.АдресатыПисем
//
Функция Адресаты(КонтактCRM) Экспорт
	
	НаборЗаписей = РегистрыСведений.СвязиАдресатКонтактCRM.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.КонтактCRM.Установить(КонтактCRM);
	НаборЗаписей.Прочитать();
	
	Результат = Новый Массив;
	Для Каждого Запись Из НаборЗаписей Цикл
		Результат.Добавить(Запись.Адресат);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Очистка связей контакта crm с адресатами
//
// Параметры:
//  КонтактCRM - ОпределяемыйТип.КонтактПисьма
//
Процедура ОчиститьСвязи(КонтактCRM) Экспорт
	
	НаборЗаписей = РегистрыСведений.СвязиАдресатКонтактCRM.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.КонтактCRM.Установить(КонтактCRM);
	НаборЗаписей.Записать();
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
